[
  {
    "10年": "入七玄门，成为墨大夫弟子，修炼《长春功》，偶得神秘小瓶。"
  },
  {
    "12年": "张铁失踪。"
  },
  {
    "13年": "《长春功》修炼到第三层。"
  },
  {
    "14年": "识厉飞雨，救其性命，因首次出手救人的不良后果，直接导致了以后无利不起早的“恶习”，为其调配减轻痛苦的灵药\r\n,意外发现神秘液体的功效\r\n炼丹服食，修炼至《长春功》第四层，五官敏感度有了质的变化\r\n张铁以“曲魂”面貌登场\r\n墨大夫露出獠牙。"
  },
  {
    "15年": "与厉飞雨建立深厚友谊\r\n《长春功》炼至第五层，获得过目不忘能力。"
  },
  {
    "16年": "《长春功》炼至第六层，习得《眨眼剑法》、《罗烟步》等数种武功\r\n在与墨大夫的火拼中意外胜出，从余子童处得知修仙界的存在，掌控曲魂\r\n开始修习简单法术，在七玄门中以韩神医身份超然存在。"
  },
  {
    "18年": "《长春功》炼至第八层，将法武结合\r\n  助七玄门击退野狼帮围攻，杀金光上人并夺其升仙令\r\n  在远处见双亲最后一面\r\n  击杀独霸山庄庄主欧阳飞天与墨氏换取暖阳宝玉，驱除寒毒\r\n  参加太南小会，对修仙界有了简单的认识\r\n  《长春功》炼至第九层\r\n  持升仙令加入黄枫谷，照看马姓老者的百药园。"
  },
  {
    "20年": "《长春功》炼至第十一层\r\n  击杀陆师兄，救出陈巧倩，获得两颗筑基丹\r\n为筑基而参加血禁试炼，在试炼中与南宫婉有了夫妻之实且收获颇丰（含一银色书页）\r\n被李化元收为记名弟子，得其赠的《青元剑诀》。"
  },
  {
    "23年": "炼筑基丹二十余颗，成功筑基，为散去药力，将《青元剑诀》炼至第四层\r\n自己开辟洞府。"
  },
  {
    "24年": "识齐云霄\r\n得《大衍决》前四层功法\r\n从李化元处得《凝元功》\r\n在《凝元功》玉简及银色书页中分别得到《青元剑诀》前十三层功法和青竹蜂云剑炼制之法。"
  },
  {
    "28年": "参加燕家举办的“夺宝大会”，期间偶遇墨彩环及其母亲严氏\r\n魔道六宗进攻越国七派\r\n《大衍决》第一层修成\r\n在守卫灵脉任务中被魔道袭击，逃跑中偶得血玉蜘蛛卵以及大挪移令\r\n《青元剑诀》炼至第五层达到筑基中期。"
  },
  {
    "29年": "在前线战场灭杀对方筑基期十几人而小有名气\r\n应李化元要求保护其师兄后人秦姓大家族\r\n赴齐云霄之约，委托辛如音修复古传送阵\r\n保护秦家过程中学会无名敛气法决，撞破黑煞教阴谋，与同门灭杀黑煞教，得虚天殿残图\r\n曲魂被御灵宗结丹修士夺舍，韩立差点成其灵兽腹中餐，灭掉修士元神得其法宝绿煌，尔后用大阵杀掉修士的灵兽，得其培育灵虫之心得\r\n七派因灵兽山倒戈而大败，六派迁移中韩立趁乱遁走\r\n齐云霄被付家人杀死，辛如音修复好古传送阵并希望韩立有能力之后灭付家一族\r\n修复古传送阵之时，因材料不足去采购，无意中碰到“南宫屏”被魔道追杀，将其救下，不想其法力却被南宫吸走，修为降至炼气三四层\r\n修复好古传送阵，传送至乱星海\r\n定居魁星岛。"
  },
  {
    "37年": "修成《大衍决》第二层\r\n修炼身外化身秘术\r\n之后二十余年在小寰岛苦修，修为提升至筑基顶峰。"
  },
  {
    "57年": "为降尘丹应六连殿之邀出海捕妖，碰巧撞破正魔两道阴谋而被结丹修士古长老追杀，趁其修为下降将其击杀，得降尘丹、法宝混元钵\r\n在海猿岛准备结丹。"
  },
  {
    "61年": "曲魂结丹成\r\n意外得噬金虫幼体\r\n定居天星城，调教灵兽，制造傀儡、符箓。"
  },
  {
    "63年": "在凝翠岛利用霓裳草杀妖取丹。"
  },
  {
    "68年": "利用妖丹炼制各种丹药，持续两年。"
  },
  {
    "70年": "闭关冲击结丹期。"
  },
  {
    "130年": "进入结丹期，期间噬金虫进化，《大衍决》炼至第三层，《青元剑诀》炼至第七层\r\n为得天雷竹受雇妙音门，落入极阴岛陷阱，侥幸逃脱\r\n成妙音门名义长老得天雷竹。"
  },
  {
    "132年": "培育出第一根万年天雷竹——金雷竹\r\n开始研究炼器以及阵法，培育金雷竹。开店“青竹小轩”，入世二十余年。"
  },
  {
    "152年": "青竹蜂云剑成\r\n受金青所邀探索古修遗址，与石蝶合力研究破阵。"
  },
  {
    "153年": "破阵后释放玄骨，靠过人实力心智将其惊退\r\n虚天殿现世，乱星海众修士探宝\r\n带元瑶、紫灵闯过第一关\r\n被玄骨算计，靠心计赢得胜利，得九曲灵参\r\n第二关救元瑶，得啼魂\r\n被极阴等人胁迫进入内殿，助取虚天鼎，即将成功之际，被星宫长老偷袭，差点死去\r\n正魔为补天丹火拼之际与玄骨一起取出虚天鼎，在一番争斗后，玄骨身死，得虚天鼎及乾蓝珠、《玄阴经》、补天丹\r\n看到元瑶裸浴，和其合力破阵后得万年灵乳及养魂木根部\r\n逆星盟成立\r\n为了摆脱大战传送至外星海奇渊岛。"
  },
  {
    "154年": "青竹蜂云剑加入炼晶\r\n目睹龟妖化形雷劫\r\n服用五色珠子。"
  },
  {
    "155年": "五色珠子炼化完毕，吸纳天地灵气和转化灵力比以前稍快\r\n做好万全准备，再次出海补妖。"
  },
  {
    "158年": "为一只七级妖兽斩杀结丹数名，被称“虫魔”而不自知。"
  },
  {
    "160年": "奇渊岛深渊妖兽暴乱。"
  },
  {
    "162年": "七年内斩杀妖兽数百，开始炼丹。"
  },
  {
    "165年": "炼丹术提升，得各种丹药。服药炼功十五六年。"
  },
  {
    "180年": "《青元剑诀》炼至第八层，进入结丹中期。此年前后，奇渊岛被妖兽攻下。之后又闭关二十多年。"
  },
  {
    "205年": "赠予公孙杏宝物\r\n改头换面参加妙音门举行的秘市，遇文思月，将其救出，从其处得知千叶露消息\r\n得梵圣真片\r\n闯风希洞穴，得千叶露\r\n进阶结丹后期，尔后被迫协助风希炼制风雷翅。"
  },
  {
    "206年": "被下风灵劲，诱三妖喝下掺杂神秘绿液的万年灵乳\r\n抢夺风雷翅，灭杀毒蛟\r\n被风希一路追杀\r\n炼化风雷翅\r\n为传至内星海替范静梅除掉云啸天，被妙鹤及风希追杀，传送至内星海皇明岛\r\n救元瑶，得赠万年灵乳、阵法玉简\r\n守护元瑶施还魂秘术，与温天仁大战，被鬼雾吸入，传送到阴冥之地，结识梅凝\r\n习得妖族文字，靠梅凝的通灵之气短暂获得灵力，收走大量“沉水”，遇天符门第五十七代掌门，受其所托将降灵符炼制之法带回天符门，啼魂进阶，斩杀阴兽，得兽晶，攀爬暴风山，杀温天仁，带紫灵、梅凝出阴冥之地\r\n以炼气期修为拜入落云宗，驱除风灵劲，炼化鸣魂珠。"
  },
  {
    "207年": "抓捕雪云狐过程中碰见尸魈，得封印尸魈魂魄盒子，银月获得肉体且成为青竹蜂云剑器灵\r\n啼魂进阶。"
  },
  {
    "208年": "参加试剑大会，接近灵眼之树，正魔两道为救活玄天仙藤抢夺灵眼之树，韩立趁乱取得定灵丹、灵眼之树根部及定灵丹和明清灵水配方。\r\n之后二十多年，《大衍决》第四层、《青元剑诀》第九层相继炼成。"
  },
  {
    "230年": "进阶元婴\r\n正式加入落云宗成为长老，纳慕沛灵为妾\r\n炼制明清灵水，开始炼化乾蓝冰焰。"
  },

  {
    "231年": "擒至木灵婴\r\n灭付家满门，拜祭辛如音与齐云霄，得《玄牡化婴大法》\r\n移走昔日洞府内的灵眼之泉，了却尘世情缘\r\n收柳眉为记名弟子，得御灵宗驱虫秘术、六翼霜蚣卵。"
  },

  {
    "232年": "参加天南交易会，用魂石从天晶真人处交换古傀儡炼制之法\r\n受南陇侯之邀探索苍坤上人遗址，路遇慕兰法士大军，九人分头逃命\r\n灭追杀之人肉身，被元婴逃脱，得千重峰、御风车\r\n苍坤遗址内被王天古等人算计，与南陇侯一起逃出\r\n返回途中救下雷万鹤等五人，得知南宫婉将要嫁人的消息\r\n再见南宫婉，带南宫加入落云宗\r\n拒绝令狐，但答应助黄枫谷三次\r\n与法士斗法中展露实力，在元婴后期修士手下逃得性命，声名鹊起\r\n见紫灵，谋划坠魔谷之行\r\n答应联盟出战得庚精、玄天仙藤\r\n炼制降灵符\r\n参加边界之战，斩杀阴罗宗宗主夫人，突兀人占领大草原，天南不得以与慕兰族和解。"
  },

  {"233年": "南宫婉被下封魂咒，青竹蜂云剑加入庚精\r\n  斩杀阴罗宗四长老，得鬼罗幡\r\n  将至木灵婴炼化为第二元婴，将尸魈炼成天绝魔尸\r\n  前往极西之地。"},

  {"235年": "从极西之地返回，带回大衍神君\r\n为解南宫之咒，探坠魔谷，与南陇侯、鲁卫英一起得火蟾兽妖丹、七焰扇炼制之法及一些灵料\r\n斩杀孽形兽，得其内丹，带紫灵取灵烛果，炼造化丹服用\r\n血焰被放出，与众修士大战，天绝魔尸遗留在坠魔谷\r\n斗法中打破空间裂缝，与血焰主魂同时跌入灵缈园遗址，两把青竹蜂云剑被血焰分身夺得，血焰主魂被禁制灭杀\r\n在灵缈园遗址内炼丹修炼。"},

  {"262年": "进阶元婴中期\r\n从灵缈园遗址逃出\r\n击败古剑门大长老，落云宗成为溪国第一大派\r\n乾蓝冰焰全部炼化，培炼虚天鼎\r\n潜入魔气深渊放阵盘，得灵岛，得四枚魔髓钻，修复鬼罗幡。"},

  {"266年": "第二元婴成，为解南宫婉的封魂咒、解决身上煞气、寻找珍稀材料出发前往大晋\r\n在天澜草原被突兀人发现携有众多噬金虫，被追杀，引动煞气反噬，无奈下修炼《五鬼锁神大法》\r\n假扮低阶仙师穿草原，救下大晋冯家弟子，得冯家密窟钥匙、苦毒\r\n被天澜兽及突兀仙师追杀，用分身之计摆脱追杀，第二元婴重伤与本体失去联系，收天澜兽，用假死之术冰封身体。"},

  {"267年": "顺河漂入大晋，银月亦陷入昏迷\r\n被曹梦容所救，恢复伤势，助其解决争端\r\n参加参王大会，得金刚舍利、晶化妖丹\r\n探索冯家密窟，得舍利子、《明王诀》，救下炫烨王，得天尸珠\r\n炼化天尸珠。"},

  {"268年": "炼成《明王诀》第一层\r\n加入皇清观，学习炼器技艺、炼制晶化妖丹飞针、修炼《明王诀》第二层。"},

  {"269年": "《明王诀》第二层修成，离开皇清观\r\n替大衍神君四处搜刮傀儡材料。"},

  {"270年": "得昊阳鸟翎、土甲龙\r\n偶遇曹梦容\r\n晋京内换得天机府，被天澜圣女及阴罗宗之人撞见，在大衍神君帮助下逃过一劫，被肖老儿以此事敲诈，灭杀肖老儿，得寒髓\r\n参加晋京拍卖会，之后在富姓老者指引下参加地下拍卖会，凑齐傀儡材料，得庚精，逃离古魔追杀\r\n到天符门送还降灵符炼制之法，遇假扮低阶弟子的向之礼，学会许多符箓炼制之法，助天符门解决争端，得化灵符\r\n灭蛟得妖兽材料\r\n在海岛炼制傀儡。"},

  {"271年": "炼成可比元婴后期傀儡，击败苦竹老人，得乌凤之翎\r\n大衍神君进入轮回，留下《大衍宝经》\r\n收服土甲龙。"},

  {"273年": "炼制三焰扇\r\n为培婴丹与富成等四人闯阴阳窟，与此同时，叶家开始布阵破昆吾山禁制\r\n阴阳窟内发现阴芝马，追逐中遇银翅夜叉，夜叉大战五人，元姓大汉、常芷芳身死，富成、白瑶怡被困，韩立一人与银翅夜叉周旋，叶家破禁后被传送至昆吾山，破禁异象震惊众修\r\n得三颗培婴丹，探索昆吾山，得太阴真火、火鼎\r\n在昆吾殿内收复圭灵，斩杀阴罗宗大长老，得封魂咒解咒之法、两杆鬼罗幡、五子同心魔\r\n八灵尺现世，众修为宝联手破禁\r\n元刹冲破封印，与珑梦斗在一起\r\n斩杀血焰，取回两把青竹蜂云剑，众修被元刹用黑风旗关入空间壁障内，众修联手破禁而出，突兀大仙师被万年尸熊偷袭，韩立为得成熟噬金虫培育之法出手将其救下，给其下叱念真雷禁制\r\n被传送至第九层空间，与众人合力对付元刹，元刹神念降临，险些被杀，被玲珑所救，噬金虫咬断石柱打破法阵，元刹神念消失，之后元刹分神引爆黑风旗将封印彻底打破，真魔气滚滚涌出，众人暂时逃离第九层\r\n封印银月关于小瓶的记忆，返回第九层助玲珑夺回躯体，玲珑返回灵界\r\n得黑风旗残骸、八灵尺以及空间节点信息\r\n寻地潜修。"},

  {"285年": "十余年时光将所得宝物尽数炼化如意\r\n为玄冰花拜访白瑶怡，对于出现在北极小夜宫的虚灵殿震惊异常\r\n答应助寒骊上人冲击化神，得精炼寒焰的秘术\r\n得花炼丹，斩杀八级妖兽救下白瑶怡\r\n同时，为了空间节点，万妖谷与冰海妖族进攻小夜宫\r\n与龙夫人、摩鸠、白梦馨、欧阳助寒骊冲击化神，目睹寒骊进阶失败，拒绝交出虚天鼎，大战起，韩立将五人灭杀收取五种寒焰，用阴灵水取下万年玄玉，太阴真火吸收玄玉寒气\r\n虚灵殿被众妖攻入，斩杀不知名妖兽，得破灭法目，为通过传送阵，与冰凤、车老妖化身大战，势均力敌，意外下传送至虚天殿\r\n因修为不足无法出殿，在殿内潜修。"},
]